In [2]:
# DataFrames 
import pandas as pd
df = pd.DataFrame({"A":[1,2,3,4,5], "B":[6,7,8,9,10]})
print(df)
print(type(df))

   A   B
0  1   6
1  2   7
2  3   8
3  4   9
4  5  10
<class 'pandas.DataFrame'>

In [ ]:
data = {
    "Name": ["John", "Anna", "James", "Linda"],
    "Age": [28, 22, 35, 32],
    "City": ["New York", "Paris", "London", "Berlin"]
}
print(data)
print(type(data))

{'Name': ['John', 'Anna', 'James', 'Linda'], 'Age': [28, 22, 35, 32], 'City': ['New York', 'Paris', 'London', 'Berlin']}
<class 'dict'>

In [ ]:
# Similar to data frames using numpy
import numpy as np
print(np.array(data))

{'Name': ['John', 'Anna', 'James', 'Linda'], 'Age': [28, 22, 35, 32], 'City': ['New York', 'Paris', 'London', 'Berlin']}

In [ ]:
# DataFrames 
pd_data = pd.DataFrame(data)
print(pd_data)
print(type(pd_data))

    Name  Age      City
0   John   28  New York
1   Anna   22     Paris
2  James   35    London
3  Linda   32    Berlin
<class 'pandas.DataFrame'>

In [ ]:
# Data Frame using list of dictories
list_data = [
    {"Name": "John", "Age": 30, "City": "New York"},
    {"Name": "Anna", "Age": 22, "City": "London"},
    {"Name": "Mike", "Age": 32, "City": "San Francisco"}
]
df = pd.DataFrame(list_data)
print(df)
print(df['Name'])
print(type(df['Name']))
print(df.iloc[0]['Age']) # 2nd row 1st column is basically label based indexing

   Name  Age           City
0  John   30       New York
1  Anna   22         London
2  Mike   32  San Francisco
0    John
1    Anna
2    Mike
Name: Name, dtype: str
<class 'pandas.Series'>
30
30

In [25]:
print(df.loc[0])
print(df.iloc[0])
print(df.iloc[0,0])
print(df.iloc[0,1])

# print(df.iloc[0][1]) # KeyError

Name        John
Age           30
City    New York
Name: 0, dtype: object
Name        John
Age           30
City    New York
Name: 0, dtype: object
John
30

In [ ]:
csv_data = pd.read_csv("customers-1000.csv")
df2 = pd.DataFrame(csv_data)
# print(df) # Prints full data
# print(df.head()) # Gives top 5 rows from top
# print(df.tail()) # Gives bottom 5 rows from bottom
print(df2.shape) # Gives number of rows and columns

(1000, 12)

In [33]:
# Accessing a specified element
list_data = [
    {"Name": "John", "Age": 30, "City": "New York"},
    {"Name": "Anna", "Age": 22, "City": "London"},
    {"Name": "Mike", "Age": 32, "City": "San Francisco"}
]
df = pd.DataFrame(list_data)
df['Name'] 
df.at[0, 'City']

'New York'

In [37]:
# Accessing specified element
df.iat[1,2]

'London'

In [38]:
# Data Manipulation with DataFrames
df

   Name  Age           City
0  John   30       New York
1  Anna   22         London
2  Mike   32  San Francisco

In [41]:
df['Salary'] = [50000, 60000, 70000]
print(df)

   Name  Age           City  Salary
0  John   30       New York   50000
1  Anna   22         London   60000
2  Mike   32  San Francisco   70000

In [ ]:
df.drop('Salary', axis=1) # Its not permanent operation
print(df)

   Name  Age           City  Salary
0  John   30       New York   50000
1  Anna   22         London   60000
2  Mike   32  San Francisco   70000

In [45]:
df.drop('Salary', axis=1, inplace=True) # Permanent operation
df

   Name  Age           City
0  John   30       New York
1  Anna   22         London
2  Mike   32  San Francisco

In [ ]:
print(df.describe()) # Gives statistical summary

             Age
count   3.000000
mean   28.000000
std     5.291503
min    22.000000
25%    26.000000
50%    30.000000
75%    31.000000
max    32.000000